onvif/MediaBinding.AddPTZConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xmime="http://tempuri.org/xmime.xsd"
 xmlns:ns4="http://www.w3.org/2004/08/xop/include"
 xmlns:ns5="http://docs.oasis-open.org/wsrf/bf-2"
 xmlns:ns2="http://www.onvif.org/ver10/schema"
 xmlns:ns3="http://docs.oasis-open.org/wsn/b-2"
 xmlns:ns6="http://docs.oasis-open.org/wsn/t-1"
 xmlns:ns7="http://www.w3.org/2005/08/addressing"
 xmlns:ns1="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Body>
   <ns1:AddPTZConfiguration>
    <ns1:ProfileToken></ns1:ProfileToken>
    <ns1:ConfigurationToken></ns1:ConfigurationToken>
   </ns1:AddPTZConfiguration>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
